load-tests/artillery/smoke-test.yml
config:
  target: 'http://{{ $processEnvironment.TARGET_URL || "localhost:3000" }}'
  phases:
    - duration: 30
      arrivalRate: 1
      name: "Smoke test - verificação básica"
  defaults:
    headers:
      'Content-Type': 'application/json'
  variables:
    cpf:
      - "12345678901"
      - "98765432100" 
      - "11122233344"
    productId:
      - "1"
      - "2"
      - "3"

scenarios:
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"

  - name: "API Root"
    weight: 10
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - hasProperty: "message"

  - name: "Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/auth/login"
          json:
            cpf: "{{ cpf }}"
          expect:
            - statusCode: [200, 401]
          capture:
            json: "$.token"
            as: "authToken"

  - name: "Products Listing"
    weight: 25
    flow:
      - get:
          url: "/products"
          expect:
            - statusCode: 200
            - hasProperty: "products"

  - name: "Customers Listing"
    weight: 15
    flow:
      - get:
          url: "/customers"
          expect:
            - statusCode: [200, 401]

before:
  flow:
    - log: "🧪 Iniciando smoke test da aplicação FIAP SOAT"
    - log: "🎯 Target: {{ $processEnvironment.TARGET_URL || 'localhost:3000' }}"

after:
  flow:
    - log: "✅ Smoke test finalizado"